Repository: CMS-Garden/cmshardening
Catalog: python/locale/*/LC_MESSAGES/hardening_messages.po
Languages: de_de

source: This tool MUST be run with root privileges, obtained using sudo!
de_de: Dieses Tool MUSS mit ROOT-Rechten ausgeführt werden, bitte nutzen Sie sudo!

source: You should not run this tool using the root account Instead, you should use sudo!
de_de: Sie nutzen nicht den ROOT-Account Nutzen sie sudo!

source: This script aims to harden some Content Management Systems (CMS) to increase the security. Among others the configuration file(s) of the CMS is altered to make use of a more secure configuration. The script can be applied to an initial installed and configured CMS as well as to a long-lived installation. For every automatic altered file there will be a backup of the original state in the corresponding backup directory.
de_de: Die Skriptlösung zur Härtung diverser Content Management Systeme (CMS) besteht aus zwei Teilen: Dieser Teil dient der Härtung des Betriebssystems sowie der dem CMS zugrunde liegenden Basiskomponenten (Webserver, Datenbank, Auslieferungssystem). Installationen von Plone und Liferay werden ebenfalls von diesem Skript abgesichert. Zur Härtung der PHP-basierten CMSe Joomla!, Wordpress und Typo3 muss im Anschluss an dieses Skript der zweite Teil der Skriptlösung in Form eines eigenen Skriptes aufgerufen werden. Die Anweisungen dazu werden Ihnen nach Abschluss dieses Skriptes angezeigt. Dieses Skript kann sowohl auf neu eingerichtete als auch bereits laufende CMS-Installationen angewendet werden. Für jede vom Skript angepasste Datei wird eine Sicherungskopie des ursprünglichen Zustands in einem Backup-Verzeichnis angelegt.

source: Introduction
de_de: Einführung

source: The following adjustments will alter your system. There is no guarantee the altered components are still working as expected. Please use this script carefully and read up about the implication of the changes. Although these hardening steps increase the security of your system, there still might exist vulnerabilities due to implementation error of certain components. The configuration suggested by this script is aimed for the test environment described in 'Sicherheitsstudie Content Management Systeme 2.0'. Other environments may require a different configuration.
de_de: Die nachfolgend durchgeführten Anpassungen verändern die Konfiguration Ihres Systems. Es kann keine Garantie gegeben werden, dass nach Anwendung der Härtungsmaßnahmen weiterhin alle Komponenten fehlerfrei funktionieren. Bitte nutzen Sie dieses Skript mit Umsicht und informieren Sie sich über die Auswirkungen der Änderungen. Die durchgeführten Härtungsmaßnahmen erhöhen die Sicherheit des Systems deutlich, können jedoch keine absolute Sicherheit bieten. Beispielsweise können Schwachstellen in der Implementierung einer Komponente (z.B. dem CMS) dazu führen, dass weiterhin Sicherheitslücken bestehen. Die von diesem Skript vorgeschlagene Konfiguration ist auf die in der 'Sicherheitsstudie Content Management Systeme 2.0' beschriebene Systemumgebung abgestimmt.Andere Umgebungen erfordern möglicherweise andere Einstellungen.

source: Attention!
de_de: Achtung!

source: no
de_de: nein

source: WARNING --- WARNING --- WARNING
de_de: WARNUNG --- WARNUNG --- WARNUNG

source: Be aware that this tool may impair your system if you are concurrently using a system management suite, such as PLESK or CONFIXX !!!§{n}§{n}You should only continue if you are are sure that no such tools are running!§{n}§{n}Do you really want to continue?
de_de: Grundsätzlich ist zu beachten, dass die Anpassungen zur Härtung nicht durchgeführt werden sollten, sofern Servermanagement-Tools wie Plesk, Confixx, LiveConfig, sysCP o.Ä. installiert sind. Sind Sie sicher, dass Sie fortfahren möchten?

source: Hardening aborted!!!!
de_de: Härtung abgebrochen!!!!

source: The hardening was stopped due to user request or unexpected behaviour. No hardening effects were applied.
de_de: Die Härtung wurde auf Wunsch des Benutzers abgebrochen oder unerwartet gestoppt. Es wurde keine Härtungsmaßnahmen angewendet.

source: Log location
de_de: Log Ort

source: Your hardening log was written to '%(location)s'
de_de: Das Härtungs-Log wurde nach '%(location)s' geschrieben.

source: No hardening log was created because no changes are necessary.
de_de: Es wurde kein Härtungs-Log angelegt, da keine notwendigen Änderungen festgestellt wurden.

source: Hardening finished!!!!
de_de: Härtung abgeschlossen!!!!

source: If you're also planning to harden one of WORDPRESS, JOOMLA or TYPO3, you should run the PHP-part of this tool:§{n}§{n} cd ../php && php index.php§{n}§{n}Please check that all your services (apache, sshd, etc.) are running as expected. If they do, you should restart your computer to make sure the hardening effects are applied.§{n}§{n}Otherwise, you should restore the old configuration from the backup files.§{n}
de_de: Es wurden keine Dienste automatisch neu gestartet. Bitte überprüfen Sie manuell, ob alle gehärteten Dienste (apache, sshd, etc.) erfolgreich neu gestartet werden können und weiterhin wie erwartet funktionieren. Bitte starten Sie nach einem erfolgreichen Test das System neu, um sämtliche Härtungseffekte anzuwenden.§{n}§{n}Sollten nicht alle Dienste wie erwartet funktionieren, stellen Sie bitte die originalen Konfigurationsdateien aus dem Backup-Verzeichnis wieder her.§{n}Um die PHP-basierten Content-Management-Systeme WORDPRESS, JOOMLA oder TYPO3 zu härten, führen Sie bitte folgendes Härtungsskript aus:§{n}§{n} cd ../php && php index.php§{n}

source: Please specify the full path to your plone buildout directory. This directory is by default located in /opt/plone/ and contains the plone buildout.cfg. E.g.: /opt/plone/buildout/
de_de: Bitte geben Sie den kompletten Pfad zu Ihrem Plone Buildout Verzeichnis an. Dieses Verzeichnis ist standardmäßig im Verzeichnis /opt/plone/ zu finden und enthält die Plone buildout.cfg. Beispiel: /opt/plone/buildout/

source: The specified directory does not exists or is not the plone buildout directory. Do you want to specify the path to your plone buildout direcctory again? If your press "no" the script will abort.
de_de: Das angegebene Verzeichnis entspricht nicht dem Plone Buildout Verzeichnis oder existiert nicht. Möchten Sie den Pfad zum Plone Buildout Verzeichnis erneut angeben? Wenn Sie "nein" angeben wird das Skript beendet.

source: Please type the path of your liferay home directory
de_de: Bitte geben Sie den Pfad Ihres Liferay Basisverzeichnisses ein

source: invalid info key in configuration: '%(keyname)s'
de_de: Ungültiger info Wert in der Konfiguration: '%(keyname)s'

source: found no value for info key '%(keyname)s'
de_de: Keinen gültigen Wert gefunden'%(keyname)s'

source: found no value for info key '%(key)s'
de_de: Keinen gültigen Wert gefunden'%(key)s'

source: using default interpolate method for value '%(key)s'
de_de: Nutzen der Standard interpolate Methode '%(key)s'

source: missing handler for '%(key)s'
de_de: Fehlender Handler für '%(key)s'

source: invalid file encoding in file '%(filename)s'
de_de: Ungültige Kodierung in der Datei '%(filename)s'

source: error while parsing '%(filename)s'
de_de: Fehler beim Parsen '%(filename)s'

source: This system has no IP addresses configured
de_de: Es wurden keine IP-Adressen konfiguriert

source: Please choose an IP address to be used for MANAGEMENT access
de_de: Bitte wählen Sie eine IP-Adresse die für den MANAGEMENT Zugriff verwendet wird

source: Please choose an IP address to be used for PUBLIC access
de_de: Bitte wählen Sie eine IP-Adresse die für den PUBLIC Zugriff verwendet wird

source: Please type the IP address of your DNS nameserver
de_de: Bitte geben Sie die IP-Adresse Ihres DNS Nameservers ein

source: yes
de_de: ja

source: (Y)ES/(n)o
de_de: (J)A/(n)ein

source: (yes)/(N)O
de_de: (j)a/(N)EIN

source: invalid default value
de_de: Ungültiger Standard-Wert

source: (Y)es/(N)o/(C)ancel
de_de: (J)a/(N)ein/(A)bbrechen

source: (Y)ES/(n)o/(c)ancel
de_de: (J)A/(n)ein/(a)bbrechen

source: (yes)/(N)O/(c)ancel
de_de: (ja)/(N)EIN/(a)bbrechen

source: cancel
de_de: abbrechen

source: (y)es/(n)o/(C)CANCEL
de_de: (j)a/(n)ein/(A)BBRECHEN

source: Your input isn't valid
de_de: Ihre Eingabe ist ungültig

source: Your value:
de_de: Ihr Wert:

source: Please insert value for property '%(property)s'
de_de: Bitte geben Sie einen Wert für '%(property)s' ein

source: aborting execution upon user request
de_de: Abbruch durch den Benutzer

source: Backup location
de_de: Ort der Backup-Dateien

source: backups have been written to '%(backupdir)s'
de_de: Backup wurde geschrieben nach '%(backupdir)s'

source: encountered an error, rolling back
de_de: Ein Fehler ist aufgetreten, Änderungen werden rückgängig gemacht

source: Please select the CMS you wish to harden
de_de: Bitte wählen Sie das CMS aus, das Sie härten möchten. Hierdurch werden CMS-spezifische Einstellungen für die Komponenten vorausgewählt. Bitte beachten Sie, dass für die PHP-basierten CMSe zusätzlich die Ausführung des zweiten Skriptteils erforderlich ist.

source: none of them
de_de: keins davon

source: Select modules to be run
de_de: Bitte wählen Sie die zu startenden Module

source: number to toggle or Return to continue; C to cancel
de_de: Nummer zum Auswählen, Enter zum Fortfahren und C zum Abbrechen

source: missing %(runutils)s entry in module %(module)s and section %(section)s
de_de: Fehlende %(runutils)s Einträge im Modul %(module)s und Sektion %(section)s

source: util '%(util)s' is already scheduled
de_de: Util '%(util)s' ist bereits geplant

source: util '%(util)s' is not enabled
de_de: Util '%(util)s' ist nicht aktiviert

source: imported %(module)s.%(class)s
de_de: %(module)s.%(class)s importiert

source: is not a subclass of HardeningUtil
de_de: ist keine Unterklasse von HardeningUtil

source: Directory %(dirname)s does not exist and will therefore not be altered.
de_de: Das Verzeichnis %(dirname)s existiert nicht und konnte daher nicht geändert werden.

source: Writing backup for '%(dirname)s' to '%(backuppath)s'.
de_de: Backup für '%(dirname)s' wird nach '%(backuppath)s' geschrieben.

source: Do you want to delete '%(dirname)s'?
de_de: Möchten Sie die Datei '%(dirname)s' löschen?

source: unable to delete '%(dirname)s' because it has been modified
de_de: '%(dirname)s' kann nicht gelöscht werden, da es vorher bearbeitet wurde

source: Ownership already set as expected.
de_de: Der Dateieigentümer entspricht bereits den Vorgaben der Härtungsmaßnahmen.

source: chown: no changes
de_de: chown: keine Änderungen vorgenommen.

source: (recursive)
de_de: (rekursiv)

source: Permissions already set as expected.
de_de: Die Berechtigungen entsprechen bereits den Vorgaben der Härtungsmaßnahmen.

source: invalid mode specified: '%(mode)s'
de_de: Ungültiger Modus angegeben: '%(mode)s'

source: Do you want to give user %(user)s the ownership of '%(file)s' and its contents? %(info)s
de_de: Möchten sie dem Nutzer %(user)s die Rechte für '%(file)s' und seine Inhalte geben? %(info)s

source: Do you want to give group %(group)s the ownership of '%(file)s'and its contents? %(info)s
de_de: Möchten sie der Gruppe %(group)s die Rechte für '%(file)s' und seine Inhalte geben? %(info)s

source: Do you want to set permissions of '%(file)s' to '%(mode)s'? %(info)s
de_de: Möchten Sie die Rechte von '%(file)s' zu '%(mode)s' ändern? %(info)s

source: Do you want to delete '%(filename)s'?
de_de: Möchten Sie die Datei '%(filename)s' löschen?

source: The file %(filename)s does not exists and will therefore not be deleted
de_de: Die Datei %(filename)s existiert nicht und kann daher nicht gelöscht werden.

source: unable to modify '%(filename)s' because it has been deleted
de_de: Ändern von '%(filename)s' nicht möglich, weil die Datei gelöscht wurde.

source: storing to: %(tempname)s
de_de: Speichern nach: %(tempname)s

source: invoking: %(command)s
de_de: Aufruf von: %(command)s

source: deleting file '%(filename)s'
de_de: Löschen der Datei '%(filename)s'

source: Writing backup for '%(filename)s' to '%(backuppath)s'.
de_de: Backup für '%(filename)s' wird nach '%(backuppath)s' geschrieben.

source: unable to delete '%(filename)s' because it has been modified
de_de: '%(filename)s' kann nicht gelöscht werden, da es vorher bearbeitet wurde

source: Do you want to set '%(key)s' to '%(value)s' for interface %(interface)s?
de_de: Möchten Sie '%(key)s' nach '%(value)s', für das Interface '%(interface)s', ändern?

source: this transaction will not create any backups!!!
de_de: Diese Transaktion erstellt keine Sicherungen!!!

source: conflicting service states
de_de: Konflikte beim Service-Status

source: Do you want to apply the following changes to '%(filename)s'
de_de: Möchten Sie die folgenden Änderungen annehmen: '%(filename)s'

source: Do you want to append the following line to '%(filename)s'? %(indent)s%(line)s
de_de: Möchten Sie die folgende Zeile an '%(filename)s' anhängen? %(indent)s%(line)s

source: Do you want to delete the following line from '%(filename)s'? %(indent)s%(line)s
de_de: Möchten Sie die folgenden Zeile aus '%(filename)s' löschen? %(indent)s%(line)s

source: Do you want to insert the following line to '%(filename)s'? %(indent)s%(line)s
de_de: Möchten Sie die folgenden Zeile in '%(filename)s' einfügen? %(indent)s%(line)s

source: Do you want to replace the following line %(indent)s%(oldline)s by %(indent)s%(newline)s in '%(filename)s'?
de_de: Möchten Sie die folgende Zeile ersetzen %(indent)s%(oldline)s durch %(indent)s%(newline)s in '%(filename)s'?

source: Do you want to append the following lines to '%(filename)s'?
de_de: Möchten Sie die folgende(n) Zeile(n) an '%(filename)s' anhängen?

source: invalid transaction state change: %(status)s --(%(function)s)-> ??
de_de: Unzulässiger Wechsel des Transaktionsstatus: %(status)s --(%(function)s)-> ??

source: invalid schema for transaction: %(schema)s
de_de: Unzulässiges Schema für Transaktion: %(schema)s

source: invalid url syntax: %(url)s
de_de: Ungültige URL-Syntax: %(url)s

source: Do you want to run the following command
de_de: Möchten Sie das folgende Kommando ausführen?

source: The section %(section)s is disabled due to the precondition%(cause)s.
de_de: Der Abschnitt %(section)s ist aufgrund der Vorbedingung %(cause)s deaktiviert.

source: The util %(util)s is disabled due to the precondition%(cause)s.
de_de: Der Abschnitt %(util)s ist aufgrund der Vorbedingung %(cause)s deaktiviert.

source: missing argument '%(option)s' for module %(class)s
de_de: Fehlendes Argument '%(option)s' für Modul %(class)s

source: this module requires a transaction of type %(transaction)s
de_de: Dieses Modul benötigt eine Transaktion des Typs %(transaction)s

source: the following package is required, but not installed: '%(package)s'
de_de: Das folgende Paket ist nicht installiert, wird aber benötigt: '%(package)s'

source: the following packages are required, but not installed: %(package)s
de_de: Die folgenden Pakete sind nicht installiert, werden aber benötigt: '%(package)s'

source: invalid datatype for key '%(key)s'
de_de: Ungültiger Datentyp für '%(key)s'

source: contains information about that specific hardening step
de_de: Enthält Informationen über den Härtungsschritt

source: contains runtime information about this hardening step
de_de: Enthält runtime Informationen über den Härtungsschritt

source: specifies under which condition this util will be run
de_de: legt fest unter welchen Bedingungen dieser util laufen wird

source: requested section '%(name)s %(param)s' not found. Creating section.
de_de: Der angeforderter Abschnitt '%(name)s %(param)s' wurde nicht gefunden. Abschnitt wird erstellt.

source: invalid value for 'multiple': '%s'
de_de: ungültiger Wert für 'multiple': '%s'

source: value of '%(key)s' in '%(filename)s' is already up to date
de_de: Werte von '%(key)s' in '%(filename)s' entsprechen bereits den Vorgaben der Härtungsmaßnahmen.

source: configuration setting has occured multiple times: '%(key)s' in %(filename)s
de_de: Konfigurationseinstellung ist mehrfach aufgetreten: '%(key)s' in %(filename)s

source: %(key)s in %(filename)s: calling insert_line()
de_de: %(key)s in %(filename)s: ruft insert_line() auf

source: %(key)s in %(filename)s: calling set_line()
de_de: %(key)s in %(filename)s: ruft set_line() auf

source: values of '%(key)s' in '%(filename)s' are already up to date
de_de: Werte von '%(key)s' in '%(filename)s' entsprechen bereits den Vorgaben der Härtungsmaßnahmen.

source: value '%(key)s%(separator)s%(value)s' in '%(filename)s' is already up to date
de_de: Wert '%(key)s%(separator)s%(value)s' in '%(filename)s' entspricht bereits den Vorgaben der Härtungsmaßnahmen.

source: missing list separator
de_de: Fehlender List-Separator

source: invalid user name: '%(user)s'
de_de: ungülter Nutzername: '%(user)s'

source: invalid group name: '%(group)s'
de_de: ungültiger Gruppennname: '%(group)s'

source: Collecting information required for module %(module)s
de_de: Sammeln von benötigten Informationen für das Modul %(module)s

source: Running module %(module)s
de_de: Starte Modul %(module)s

source: Leaving module %(module)s
de_de: Schliesse Modul %(module)s

source: invalid ip address in firewall rule
de_de: Ungültige IP-Adresse in Firewall-Regel

source: invalid protocol specified: '%(protocol)s'
de_de: Ungültiges Protokoll angegeben: '%(protocol)s'

source: invalid version comparison operator: '%(operation)s'
de_de: Ungültiger Vergleichsoperator: '%(operation)s'

source: invalid key for version check: '%(key)s'
de_de: Ungültiger Schlüssel für Versionsprüfung: '%(key)s'

source: It does seems like %(key)s is not installed on your system. This isn't a problem if you don't need it but you should consider removingthe hardening module for %(key)s in the global config.yml.
de_de: %(key)s konnte nicht gefunden werden. Das ist kein Problem, wenn Sie das Härtungsmodul nicht benötigen. Sie sollten jedoch %(key)s deaktivieren.

source: Your %(key)s version is older then '%(version)s'.You should consider updating it.
de_de: Ihre Version von %(key)s ist älter als '%(version)s'. Sie sollten die Version updaten.

source: Your %(key)s version is up to date.
de_de: Die %(key)s Version ist aktuell.

source: invalid service action: '%(action)s'
de_de: Ungültige Aktion: '%(action)s'
